## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # zentral_mdm_blueprint.default will be updated in-place
  ~ resource "zentral_mdm_blueprint" "default" {
        id                              = 1
        name                            = "Default"
      ~ software_update_enforcement_ids = [
          + (known after apply),
        ]
        # (5 unchanged attributes hidden)
    }

  # zentral_mdm_software_update_enforcement.default will be created
  + resource "zentral_mdm_software_update_enforcement" "default" {
      + delay_days     = 7
      + id             = (known after apply)
      + local_time     = (known after apply)
      + max_os_version = "15"
      + name           = "Default"
      + platforms      = [
          + "macOS",
        ]
      + tag_ids        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # zentral_monolith_manifest_sub_manifest.default-apps will be created
  + resource "zentral_monolith_manifest_sub_manifest" "default-apps" {
      + id              = (known after apply)
      + manifest_id     = 1
      + sub_manifest_id = (known after apply)
      + tag_ids         = (known after apply)
    }

  # zentral_monolith_sub_manifest.apps will be created
  + resource "zentral_monolith_sub_manifest" "apps" {
      + description = "The mandatory apps for our standard macOS client"
      + id          = (known after apply)
      + name        = "Mandatory apps"
    }

  # zentral_monolith_sub_manifest_pkg_info.onepassword will be created
  + resource "zentral_monolith_sub_manifest_pkg_info" "onepassword" {
      + default_shard    = 100
      + excluded_tag_ids = []
      + featured_item    = false
      + id               = (known after apply)
      + key              = "managed_installs"
      + pkg_info_name    = "1Password"
      + shard_modulo     = 100
      + sub_manifest_id  = (known after apply)
      + tag_shards       = []
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>